---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Insert(Autodesk.Revit.DB.Electrical.WireConduitType)
source: html/1ad55a62-8551-c892-e5a9-c700a8580a32.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Insert Method

Insert the specified conduit type into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	WireConduitType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireConduitType`) - The conduit type to be inserted into the set.

## Returns
Returns whether the conduit type was inserted into the set.